
# Week 7: SciPy and pandas

Charlotte Desvages

## pandas

pandas is a package for **data analysis and manipulation**.

It introduces 2 new container types: `Series` (for 1D data, e.g. time series) and `DataFrame` (for 2D data, e.g. something you could see in a spreadsheet).

In [3]:
import pandas as pd

contestants = {'name': ['Mariam', 'Hashim', 'Ayesha', 'Ronan', 'Louisa', 'Benjamin'],
               'age': [51, 32, 33, 46, 29, 44],
               'city': ['Perth', 'Edinburgh', 'Glasgow', 'Inverness', 'Falkirk', 'Aberdeen'],
               'team': ['red', 'red', 'blue', 'red', 'blue', 'blue']}

df = pd.DataFrame(contestants, index=range(1, 7))
df # print(df)

       name  age       city  team
1    Mariam   51      Perth   red
2    Hashim   32  Edinburgh   red
3    Ayesha   33    Glasgow  blue
4     Ronan   46  Inverness   red
5    Louisa   29    Falkirk  blue
6  Benjamin   44   Aberdeen  blue

In [5]:
df = pd.DataFrame(contestants, index=range(1,7))
df

       name  age       city  team
1    Mariam   51      Perth   red
2    Hashim   32  Edinburgh   red
3    Ayesha   33    Glasgow  blue
4     Ronan   46  Inverness   red
5    Louisa   29    Falkirk  blue
6  Benjamin   44   Aberdeen  blue

In [6]:
df = pd.DataFrame(contestants, index=[f'Contestant {i}' for i in range(1, 7)])
df

                  name  age       city  team
Contestant 1    Mariam   51      Perth   red
Contestant 2    Hashim   32  Edinburgh   red
Contestant 3    Ayesha   33    Glasgow  blue
Contestant 4     Ronan   46  Inverness   red
Contestant 5    Louisa   29    Falkirk  blue
Contestant 6  Benjamin   44   Aberdeen  blue

In [7]:
df['age']

Contestant 1    51
Contestant 2    32
Contestant 3    33
Contestant 4    46
Contestant 5    29
Contestant 6    44
Name: age, dtype: int64

In [10]:
df.loc['Contestant 3', :]

name     Ayesha
age          33
city    Glasgow
team       blue
Name: Contestant 3, dtype: object

In [11]:
df.iloc[2, :]

name     Ayesha
age          33
city    Glasgow
team       blue
Name: Contestant 3, dtype: object

In [12]:
df['team'] == 'blue'

Contestant 1    False
Contestant 2    False
Contestant 3     True
Contestant 4    False
Contestant 5     True
Contestant 6     True
Name: team, dtype: bool

In [14]:
df.loc[df['team'] == 'blue']

                  name  age      city  team
Contestant 3    Ayesha   33   Glasgow  blue
Contestant 5    Louisa   29   Falkirk  blue
Contestant 6  Benjamin   44  Aberdeen  blue

In [9]:
df.loc[df['team'] == 'blue', ['age', 'name']]

              age      name
Contestant 3   33    Ayesha
Contestant 5   29    Louisa
Contestant 6   44  Benjamin

## pandas

There is a **lot** that pandas can do. We'll see more examples next week, but as for SciPy, consulting the documentation is always a good idea.